<!DOCTYPE html>
<html lang="es" id="top">
    <head>
        <meta charset="utf-8" />
        <title>Bolche-Bot [beta]</title>
        
        <link rel="stylesheet" type="text/css" href="styles.css">
        <link href="https://fonts.googleapis.com/css2?family=Lato:wght@400;700&family=Roboto&display=swap" rel="stylesheet">
        <link rel="icon" type="image/png" href="logo.png"/> 
    </head>
    <body>
        <nav>
            <a>Bolche-Bot, by Zusmo.</a>
            <a>|</a>
            <a href="#description">Descripci&oacute;n</a>
            <a>|</a>
            <a href="#historia">Historia</a>
            <a>|</a>
            <a href="#comandos">Comandos</a>
            <a>|</a>
            <a href="#changelog">Changelog</a>
        </nav>
    </br>
        <div class="top">
        <h1><strong>Bolche-Bot,</strong></h1>
        <h3><em>el bot de discord oficial de la Uni&oacute;n Sovi&eacute;tica Espartana.</em></h3>
        </div>
        <div id ="description">
            <h2>Descripci&oacute;n:</h2>
            <p>El Bolche-Bot es un bot de discord programado en JavaScript, a trav&eacute;s de la librer&iacute;a "Discord.js"</p>
        </div>
        <div id="historia">
            <h2>Historia:</h2>
            <p>
            La idea de programar un bot surgi&oacute;, como muchas cosas, por necesidad. El plan original era tener un bot que detect&aacute;se 
            cuando alguien estuvi&eacute;se en un canal de voz, y usar&iacute;a un comando de otro bot para poner una canci&oacute;n al azar. 
            Lamentablemente esto no se pudo lograr, no ten&iacute;a (ni tengo) los conocimientos necesarios para que el bot detect&aacute;se que alguien est&eacute; 
            en el canal de voz, y adem&aacute;s, los bots no toman en cuenta los mensajes de otros bots, por lo que tampoco podr&iacute;a usar comandos. 
            Me di por vencido con esa idea, pero de todos modos continu&eacute; con el desarrollo del bot, agregando nuevas funciones y chistes, 
            por que ese es el objetivo principal, el entretenimiento. 
            </p>
        </div>
        <div class="comandos">
            <h2>Comandos:</h2>
            <p>Utilidad</p>
            <ul>
                <li>!should => Si deberías o no jugar a algo, con 50% de probabilidades. Sirve cualquier argumento, solo se usa la primera palabra. </br>
                Ej: !should Skyrim, responde <em>Deber&iacute;as jugar al Skyrim.</em></li>

                </br>

                <li>!decide => Decide entre los dos argumentos entregados. </br>
                Ej: !decide ekko lee, responde <em>ekko</em></li>

                </br>

                <li>!ranNum => Devuelve un n&uacute;mero al azar que se encuentre entre los valores especificados. Solo se pueden ocupar n&uacute;meros como argumentos. </br>
                Ej: !ranNum 7 14, responde <em>11</em></li>

                </br>

                <li>!avatar => Responde con tu avatar de Discord. </br>
                Ej: !avatar, responde <em>Ten, la siguiente vez serán 2 dólares. [foto del avatar]</em></li>

                </br>

                <li>!build => Devuelve el link de League of Graphs del campeón especificado. El argumento tiene que ser el nombre del campeón en inglés. </br>
                Ej: !build ornn, responde <em>Aquí está el resultado de tu busqueda: [link]</em></li>

                </br>

                <li>!badlofi => M&uacute;sica compuesta por el admin.</li>
            </ul>

            <p>Entretenimiento:</p>

            <ul>
                <li>!game => Probabilidades de ganar el game. Argumentos: carry, noCarry y tryndaNoIgnite. </br>
                Ej: !game noCarry, responde <em>55% de probabilidades de ganar el game.</em></li>

                </br>

                <li>!puente => Probabilidades de tirarse de un puente: Argumentos: vicho (también funciona sin argumento). </br> 
                Ej: !puente, responde <em>Las probabilidades de que @nombre se tire de un puente son de 31 %</em></li> 

                </br>

                <li>!cringe => Indica que lo que acaba de suceder fue cringe. </br>
                Ej: !cringe, responde <em>Definitivamente cringe</em>(en tts)</li>

                </br>

                <li>!gg => El bot te felicita a ti o a alguna persona que especifiques en el argumento. </br>
                Ej: !gg bot, responde <em>Omedetou, bot-kun</em></li>

                </br>

                <li>!succ y !succf => (Argumento) la chupa. La variación con "f" sirve para la versión femenina.</li>

                </br>

                <li>!music => Se explica solo, no necesita argumentos. 

                </br>
                </br>

                <li>!admin => Mensaje en TTS del bot.</li>

                </br>

                <li>!respect => jaja imagen chistosa.</li>

                </br>

                <li>!cumple => El bot le desea un feliz cumpleaños a la persona especificada.</li>

                </br>

                <li>!buy => Comprarle un producto al bot, actualmente solo tiene empanada de pino. Argumentos: empanada.</li>
            </ul>

            <p>Otras Funciones:</p>

            <ul>
                <li>probabilidades => Si comienzas el mensaje con esta palabra, el bot responderá las probabilidades de que eso ocurra.</br>
                Ej: probabilidades de que el comando funcione, responde <em>33% probabilidades de que el comando funcione.</em></li>

                </br>

                <li>debería => Si comienzas el mensaje con esta palabra, el bot responderá si deberías hacer esa acción.</br>
                Ej: deber&iacute;a seguir escribiendo el c&oacute;digo de esta p&aacute;gina?</li>
            </ul>
        </div>
        <div id="changelog">
            <h2>Changelog:</h2>
            <p>Hasta el momento de hacer esta p&aacute;gina, no llevé registro del desarrollo del bot. Por esto considerar&eacute; la versi&oacute;n actual como la 1.0.0</p>
            <ul>
                <li>26 de septiembre: Se a&ntilde;adieron los comandos "!buy" y "!build"</li>
            </ul>
        </div>
        <div class="footer">
            <footer>
                volver arriba <a href="#top">↑</a>
            </footer>
        </div>
        <script src="main.js" type="text/javascript"></script>
    </body>
</html>
